{"keras_version": "2.2.2", "config": [{"config": {"activity_regularizer": null, "activation": "linear", "batch_input_shape": [null, 40, 1600], "use_bias": true, "trainable": true, "bias_regularizer": null, "units": 128, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "masking_1", "trainable": true, "mask_value": 0.0}, "class_name": "Masking"}, {"config": {"implementation": 1, "stateful": false, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "tanh", "units": 128, "return_sequences": true, "bias_constraint": null, "activity_regularizer": null, "dropout": 0.0, "return_state": false, "unroll": false, "name": "lstm_1", "trainable": true, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"implementation": 1, "stateful": false, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "tanh", "units": 128, "return_sequences": false, "bias_constraint": null, "activity_regularizer": null, "dropout": 0.0, "return_state": false, "unroll": false, "name": "lstm_2", "trainable": true, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "name": "dense_2", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 52, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}