{"config": [{"config": {"batch_input_shape": [null, 40, 1600], "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activation": "linear", "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 128, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "mask_value": 0.0, "name": "masking_1"}, "class_name": "Masking"}, {"config": {"return_sequences": true, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "stateful": false, "activity_regularizer": null, "unroll": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_state": false, "bias_regularizer": null, "name": "lstm_1", "recurrent_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "trainable": true, "use_bias": true, "units": 128, "implementation": 1, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"return_sequences": true, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "stateful": false, "activity_regularizer": null, "unroll": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_state": false, "bias_regularizer": null, "name": "lstm_2", "recurrent_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "trainable": true, "use_bias": true, "units": 128, "implementation": 1, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 52, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2"}